/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Extension Telesec";
"06 06 02 82 06 01 0A 01"		= "Mécanisme Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Authentification Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Authentification avec mot de passe";
"06 08 02 82 06 01 0A 01 00 02" = "Authentification protégée par mot de passe";
"06 08 02 82 06 01 0A 01 00 03" = "Authentification X.509 unidirectionnelle";
"06 08 02 82 06 01 0A 01 00 04" = "Authentification X.509 bidirectionnelle";
"06 08 02 82 06 01 0A 01 00 05" = "Authentification X.509 tridirectionelle";
"06 08 02 82 06 01 0A 01 00 06" = "Authentification ISO9798 unidirectionnelle";
"06 08 02 82 06 01 0A 01 00 07" = "Authentification ISO9798 bidirectionnelle";
"06 08 02 82 06 01 0A 01 00 08" = "Authentification Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Signature Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 avec RSA et ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 avec RSA et signature standard Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 avec RSA et ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 avec RSA et signature standard Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 avec RSA et signature standard Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Signature HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Chiffrement Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "aucun";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Fonction unidirectionnelle";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hachage via chiffrement par bloc (block cipher)";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Fonction FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Module Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algorithmes";
"06 07 02 82 06 01 0A 02 01"	= "Types d’attributs";
"06 07 02 82 06 01 0A 02 02"	= "Types de certificats";
"06 07 02 82 06 01 0A 02 03"	= "Types de message";
"06 07 02 82 06 01 0A 02 04"	= "Protocole PL";
"06 07 02 82 06 01 0A 02 05"	= "SME et composantes de SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Définitions utiles";
"06 07 02 82 06 01 0A 02 08"	= "Fichiers STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Commande électronique";
"06 07 02 82 06 01 0A 02 0B"	= "Application asymétrique Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Application de base Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Messages Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Application avec marquage de l’heure Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Classe d’objets";
"06 07 02 82 06 01 0A 03 00"	= "Autre nom Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Répertoire";
"06 07 02 82 06 01 0A 03 02"	= "Type de répertoire";
"06 07 02 82 06 01 0A 03 03"	= "Groupe de répertoire";
"06 07 02 82 06 01 0A 03 04"	= "Utilisateur du répertoire";
"06 07 02 82 06 01 0A 03 05"	= "Entrée de clé symétrique";

"06 06 02 82 06 01 0A 04"		= "Paquet";
"06 06 02 82 06 01 0A 05"		= "Paramètre";
"06 06 02 82 06 01 0A 06"		= "Attribution de nom";
"06 06 02 82 06 01 0A 07"		= "Attribut";
"06 07 02 82 06 01 0A 07 00"	= "Identifiant du groupe d’application";
"06 07 02 82 06 01 0A 07 01"	= "Type de certificat";
"06 07 02 82 06 01 0A 07 02"	= "Certificat Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Numéro de certificat";
"06 07 02 82 06 01 0A 07 04"	= "Liste de révocation de certificats (CRL)";
"06 07 02 82 06 01 0A 07 05"	= "Date de création";
"06 07 02 82 06 01 0A 07 06"	= "Émetteur";
"06 07 02 82 06 01 0A 07 07"	= "Autorité de nommage";
"06 07 02 82 06 01 0A 07 08"	= "Répertoire de clé publique";
"06 07 02 82 06 01 0A 07 09"	= "Domaine de sécurité";
"06 07 02 82 06 01 0A 07 0A"	= "Objet";
"06 07 02 82 06 01 0A 07 0B"	= "Heure de révocation";
"06 07 02 82 06 01 0A 07 0C"	= "Référence du groupe d’utilisateur";
"06 07 02 82 06 01 0A 07 0D"	= "Validité";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Environnement du message de sécurité";
"06 07 02 82 06 01 0A 07 10"	= "Répertoire de clé publique anonyme";
"06 07 02 82 06 01 0A 07 11"	= "Surnom Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Ajouts de noms";
"06 07 02 82 06 01 0A 07 13"	= "Code postale Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Distinction de nom";
"06 07 02 82 06 01 0A 07 15"	= "Liste de certificat Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Liste de certificat Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Liste de certificat X.509";
"06 07 02 82 06 01 0A 07 18"	= "Heure d’émission";
"06 07 02 82 06 01 0A 07 19"	= "Numéro de la carte physique";
"06 07 02 82 06 01 0A 07 1A"	= "Type de fichier";
"06 07 02 82 06 01 0A 07 1B"	= "Le fichier Ctl est une archive";
"06 07 02 82 06 01 0A 07 1C"	= "Adresse électronique";
"06 07 02 82 06 01 0A 07 1D"	= "Liste de modèles de certificats";
"06 07 02 82 06 01 0A 07 1E"	= "Nom du répertoire";
"06 07 02 82 06 01 0A 07 1F"	= "Nom de type de répertoire";
"06 07 02 82 06 01 0A 07 20"	= "Nom du groupe de répertoire";
"06 07 02 82 06 01 0A 07 21"	= "Nom d’utilisateur du répertoire";
"06 07 02 82 06 01 0A 07 22"	= "Drapeau de révocation";
"06 07 02 82 06 01 0A 07 23"	= "Nom d’entrée de clé symétrique";
"06 07 02 82 06 01 0A 07 24"	= "Numéro GL";
"06 07 02 82 06 01 0A 07 25"	= "Numéro GO";
"06 07 02 82 06 01 0A 07 26"	= "Données de la clé G";
"06 07 02 82 06 01 0A 07 27"	= "Données de la clé Z";
"06 07 02 82 06 01 0A 07 28"	= "Données de la clé KT";
"06 07 02 82 06 01 0A 07 2A"	= "Numéro de la clé KT";
"06 07 02 82 06 01 0A 07 33"	= "Heure de génération de la révocation";
"06 07 02 82 06 01 0A 07 34"	= "Texte de responsabilité";

"06 06 02 82 06 01 0A 08"		= "Groupe d’attributs";
"06 06 02 82 06 01 0A 09"		= "Opération";
"06 06 02 82 06 01 0A 0A"		= "Notification";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Application de sécurité";

"06 06 02 82 06 01 0A 0C"		= "Certificat et définitions d’extension CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Extension de limitation de responsabilité d’extension de certificat";
"06 07 02 82 06 01 0A 0C 01"	= "Extension de l’identifiant du certificat Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identifiant du règlement Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "Identifiant du qualificatif du règlement Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Extension filtrée CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Extension de filtre CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Extension de l’autorité de nommage Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Identifiant utilisateur";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Messagerie RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Composante de domaine";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Numéro commercial australien";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identifiant du règlement des certificats d’Australie";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet - Personnel";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet - Commercial";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet - Légal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet - Pilote";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet - IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet - Identifiant du règlement";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algorithme de chiffrement symétrique";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Identifiant du règlement SEIS High-Assurance";
"06 06 2A 85 70 22 01 02"	= "Identifiant du règlement SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Identifiant personnel SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Module ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Gestion du certificat X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instruction de suspension";
"06 07 2A 86 48 CE 38 02 01"	= "Suspension de certificat - Aucune";
"06 07 2A 86 48 CE 38 02 02"	= "Appeler l’émetteur";
"06 07 2A 86 48 CE 38 02 03"	= "Rejeter";
"06 07 2A 86 48 CE 38 02 04"	= "Collecte du jeton";
"06 06 2A 86 48 CE 38 03"		= "Attribut";
"06 06 2A 86 48 CE 38 03 01"	= "Deuxième signature";
"06 06 2A 86 48 CE 38 03 02"	= "Certificat d’attribut";
"06 06 2A 86 48 CE 38 04"		= "Algorithme";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Concordance DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA avec SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Champ de type ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Champ primaire";
"06 07 2A 86 48 CE 3D 01 02"	= "Caractéristique-deux champs";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Caractéristique-deux bases";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Base nulle";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Base trinomiale";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Base pentanomiale";
"06 06 2A 86 48 CE 3D 02"		= "Type de clé publique";
"06 07 2A 86 48 CE 3D 02 01"	= "Clé publique à courbe elliptique";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Champ de type ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois Field Prime";
"06 06 2A 86 48 CE 3E 02"		= "Type de nombre";
"06 07 2A 86 48 CE 3E 02 01"	= "Clé publique de Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Schéma";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman statique";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman éphémère";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman hybride 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman hybride 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Données sur la version Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE avec MD5 et CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC avec mot de passe";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Utilisateur Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Informations de l’AC Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificat d’attribut";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Chiffrement RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Chiffrement RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Etiquette spécifiée RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Schéma de signature RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 avec chiffrement RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 avec chiffrement RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Chiffrement par BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Accord de la clé Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE avec MD2 et DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE avec MD5 et DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE avec MD2 et RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE avec MD5 et RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE avec MD5 et XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE avec SHA et DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Données";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Données signées";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Données encapsulées";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Données signées et encapsulées";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Données condensées";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Données chiffrées";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Données avec attributs";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Information relative à la clé privée chiffrée";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Adresse électronique";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nom non structuré";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Type de contenu";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Message condensé";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Heure de signature";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Deuxième signature";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Vérifier le mot de passe";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Adresse non structurée";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Attributs du certificat étendu";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emetteur et numéro de série";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Vérification de mot de passe";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Clé publique";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Signature de la description";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Requête d’extension";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Capacités S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Préférer les données signées";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Impossible de déchiffrer";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Requête de reçu";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Reçu";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Indications de contenu";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Historique de l’expansion de la liste de courrier";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Modules S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Syntaxe de message chiffré";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Services de sécurité améliorée";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identifiant d’objet S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Message S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Signature électronique ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Signature électronique ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Signature électronique ETS règlement 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Signature électronique ETS règlement 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Types de contenu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Attributs S/MIME authentifiés";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algorithmes S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribution de certificat S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribution de certificat LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Qualificatif de règlement de signature S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identifiant de type de signature S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Signature de l’initiateur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Signature de domaine";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Signature des attributs supplémentaires";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Revoir la signature";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Capacités S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Préférer binaire interne";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nom amical (pour PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Identifiant de clé local (pour PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Types de certificats (pour PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificat X.509 (pour PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificat SDSI (pour PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Types de CRL (pour PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (pour PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Syntaxe d’échange d’informations personnelles par PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "Identifiants de chiffrement PKCDS-12 avec mot de passe";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE avec SHA-1 et RC4 128 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE avec SHA-1 et RC4 40 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE avec SHA-1 et 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE avec SHA-1 et 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE avec SHA-1 et RC2-CBC 128 bits";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE avec SHA-1 et RC2-CBC 40 bits";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "Identifiants PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Masquage de clé PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "Identifiants de bag PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "Identifiant de bag de clé PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Certificat PKCS-12 et identifiant de bag CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "Identifiant de bag secret PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "Identifiant de contenus garantis PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "Identifiant de bag de clé masqué PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Identifiant de bag de certificat PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Identifiant de bag CRL et certificat PKCS-12 X.509";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Identifiant de bag de certificat PKCS-12 SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "OID PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "Identifiant de chiffrement PKCS-12 avec mot de passe";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE avec SHA-1 et RC4 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE avec SHA-1 et RC4 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE avec SHA-1 et Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE avec SHA-1 et RC2-CBC 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE avec SHA-1 et RC2-CBC 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE avec SHA-1 et RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE avec SHA-1 et RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "Identifiants d’encapsulation PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Chiffrement RSA PKCS-12 avec RC4 128 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Chiffrement RSA PKCS-12 avec RC4 40 bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Chiffrement RSA PKCS-12 avec Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Identifiant de signature PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Signature PKCS-12 RSA avec SHA-1 condensé";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Version 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "Identifiants de bag PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Bag de clé PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Bag de clé PKCS-12 PKCS-8 dissimulé";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Bag de certificat PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Bag CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Bag secret PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Bag de contenu garanti PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Modules PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Attributs PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Type du contenu PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Contenu de PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algorithme RSADSI condensé";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC avec SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algorithme de chiffrement RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 avec MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Ensemble RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identifiant de règlement inconnu Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "OCSP Identrus";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Classe d’objets Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Adressage de sites";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Schéma de classe";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Schéma d’attribut";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agent-courrier";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Boîte aux lettres";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Conteneur";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinataire du courrier";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mécanisme de livraison";

"06 07 2A 86 48 86 F7 14 04"				= "Formats de fichier Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Code d’authentification";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Contexte de données de SPC indirectes";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Infos d’agence SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Type d’instruction SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Infos SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Extensions de certificat SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Données d’image SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Lien SPC (type 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Signature de code individuel";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Signature de code commercial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Lien SPC (type 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Critères minimaux SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Critères financiers SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Lien SPC (type 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Fournisseur de support de sécurité NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Deuxième signature de marquage de l’heure";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Liste de confiance de certificat";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Extension de CTL classés";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Emplacement de la prochaine mise à jour";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Utilisation de clé améliorée";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Signature de la liste de certificat de confiance";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Signature de marquage de l’heure";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Cryptographie SGC (Server-Gated Cryptography)";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Chiffrement sérialisé";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Systèmes de fichiers chiffrés";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Récupération de systèmes de fichiers chiffrés";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatible avec le matériel Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Signature NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Signature OEM du matériel Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Signature de NT intégré";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Signature de la liste racine de confiance";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordination qualifiée";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Récupération de clé";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Signature de document";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identifiants de l’objet de l’attribut";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Attribut de confiance Oui/Non";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Système de gestion des droits musicaux Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualisation DRM Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licenses Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "License serveur Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identifiants de l’objet Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificat de renouvellement";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Inscription de paire Nom/Valeur";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Inscription CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Version OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Attributs Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Ensemble de clés d’ordinateur local";

"06 08 2B 06 01 04 01 82 37 14"				= "Infrastructure d’inscription Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Utilisation de l’auto-inscription CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Type de certificat d’inscription";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agent d’inscription";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Ouverture de session Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nom principal NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infrastructure de serveur de certificat Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Version renouvelée du CA Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Version CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Attribut CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nom du document";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Description de document";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Données chiffrées";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Contenu chiffré";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identifiant de règlement UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identifiant du règlement ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identifiant du règlement de l’AC ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal avec SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal avec RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Attribut cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Vérification de la présence de cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "Réponse OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Réponse OCSP RTCS étendu";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Raison étendue CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Fonctionnalités de clé";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Démarrage de PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Contenu cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Données de configuration cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Index utilisateur cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Informations utilisateur cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identifiant de règlement XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "A l’épreuve du temps";
"06 08 2B 06 01 04 01 AA 60 01"		= "Système de signature temporelle";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Système de signature temporelle 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Système de signature temporelle 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Système de signature temporelle 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Pratiques secondaires";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identifiants de médecins";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos 5";
"06 06 2B 06 01 05 02 03"           = "PKINIT Kerberos";
"06 07 2B 06 01 05 02 03 01"        = "Données d’authentification Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Données de la clé Diffie-Hellman Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Données de la clé de réponse Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Authentification du client Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Centre de distribution de clés Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Mécanisme de clé publique simple (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastructure de clé publique (PKI)";

"06 07 2B 06 01 05 05 07 01"		= "Extensions du certificat privé PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Accès aux informations de l’autorité de certification";
"06 08 2B 06 01 05 05 07 01 02"		= "Données biométriques";
"06 08 2B 06 01 05 05 07 01 03"		= "Instructions du certificat qualifié";
"06 08 2B 06 01 05 05 07 01 04"		= "Identité de l’audit du certificat de l’attribut";
"06 08 2B 06 01 05 05 07 01 05"		= "Optimisation du certificat de l’attribut";
"06 08 2B 06 01 05 05 07 01 06"		= "Contrôles de l’autorité du certificat de l’attribut";
"06 08 2B 06 01 05 05 07 01 07"		= "Bloc d’adresses IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Identifiant du système autonome SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identifiant du routeur SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxying du certificat de l’attribut";
"06 08 2B 06 01 05 05 07 01 0B"		= "Accès aux informations du sujet";
"06 08 2B 06 01 05 05 07 01 0C"		= "Type de logo";

"06 07 2B 06 01 05 05 07 02"		= "Types de qualificatif de règlement";
"06 08 2B 06 01 05 05 07 02 01"		= "Instruction sur l’usage de la certification";
"06 08 2B 06 01 05 05 07 02 02"		= "Notice utilisateur";
"06 08 2B 06 01 05 05 07 02 03"		= "Notice";

"06 07 2B 06 01 05 05 07 03"		= "Objectif de la clé";
"06 08 2B 06 01 05 05 07 03 01"		= "Authentification du serveur";
"06 08 2B 06 01 05 05 07 03 02"		= "Authentification du client";
"06 08 2B 06 01 05 05 07 03 03"		= "Signature de code";
"06 08 2B 06 01 05 05 07 03 04"		= "Protection du courrier électronique";
"06 08 2B 06 01 05 05 07 03 05"		= "Système final IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Tunnel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Utilisateur IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Marquage de l’heure";
"06 08 2B 06 01 05 05 07 03 09"		= "Signature OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Authentification du serveur SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Types d’informations CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificat de chiffrement du protocole de l’AC";
"06 08 2B 06 01 05 05 07 04 02"		= "Signature des types de bi-clé";
"06 08 2B 06 01 05 05 07 04 03"		= "Chiffrement des types de bi-clé";
"06 08 2B 06 01 05 05 07 04 04"		= "Algorithme symétrique préféré";
"06 08 2B 06 01 05 05 07 04 05"		= "Information de mise à jour de la clé de l’AC";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL actuelle";
"06 08 2B 06 01 05 05 07 04 07"		= "OID non gérés";
"06 08 2B 06 01 05 05 07 04 08"		= "Requête d’abonnement";
"06 08 2B 06 01 05 05 07 04 09"		= "Réponse d’abonnement";
"06 08 2B 06 01 05 05 07 04 0A"		= "Requête du paramètre de la bi-clé";
"06 08 2B 06 01 05 05 07 04 0B"		= "Réponse du paramètre de la bi-clé";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Enregistrement CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Contrôle de l’enregistrement";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Jeton d’enregistrement";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Authentifiant";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Information de publication de PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Options d’archive PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Identifiant de l’ancien certificat";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Clé de chiffrement du protocole";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Modèle de certificat alternatif";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Modèle WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Information sur l’enregistrement CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Paires UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Requête de certificat";

"06 07 2B 06 01 05 05 07 06"		= "Algorithmes";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Aucune signature";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Contrôles CMC";

"06 07 2B 06 01 05 05 07 08"		= "Autre noms";
"06 08 2B 06 01 05 05 07 08 01"		= "Données personnelles";
"06 08 2B 06 01 05 05 07 08 02"		= "Groupe d’utilisateur";

"06 07 2B 06 01 05 05 07 09"		= "Données personnelles";
"06 08 2B 06 01 05 05 07 09 01"		= "Naissance";
"06 08 2B 06 01 05 05 07 09 02"		= "Lieu de naissance";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonyme";
"06 08 2B 06 01 05 05 07 09 04"		= "Sexe";
"06 08 2B 06 01 05 05 07 09 05"		= "Pays d’origine";
"06 08 2B 06 01 05 05 07 09 06"		= "Pays de résidence";

"06 07 2B 06 01 05 05 07 0A"		= "Certificat d’attribut";
"06 08 2B 06 01 05 05 07 0A 01"		= "Données d’authentification";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identité d’accès";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identité en cours de chargement";
"06 08 2B 06 01 05 05 07 0A 04"		= "Groupe";
"06 08 2B 06 01 05 05 07 0A 05"		= "Rôle";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "OCSP (protocole d’état de certificat en ligne)";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Réponse élémentaire OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Extension OCSP Nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Référence CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Réponse OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP Aucune vérification de révocation";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Coupure d’archive OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Localisateur de service OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Emetteurs de l’autorité de certification";
"06 08 2B 06 01 05 05 07 30 03"		= "Marquage de l’heure";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE intermédiaire";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algorithme de chiffrement DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algorithme de hachage DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algorithme de signature DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 avec RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 avec RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 avec RSA";
"06 05 2B 0E 03 02 03"				= "MD5 avec RSA";
"06 05 2B 0E 03 02 04"				= "MD4 avec chiffrement RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N avec RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Signature RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA avec SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 avec signature RSA";
"06 05 2B 0E 03 02 0F"				= "SHA avec signature RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman avec Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA commun";
"06 05 2B 0E 03 02 15"				= "DSA commun avec SHA";
"06 05 2B 0E 03 02 16"				= "Clé de transport RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 avec signature RSA";
"06 05 2B 0E 03 02 19"				= "MD5 avec signature RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA avec SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA avec SHA-1 commun";
"06 05 2B 0E 03 02 1D"				= "SHA-1 avec chiffrement RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 avec RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 avec ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Document";
"06 04 2B 24 01 01"					= "Version finale";
"06 04 2B 24 01 02"					= "Brouillon";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algorithme";
"06 04 2B 24 03 01"					= "Algorithme de chiffrement";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Ensemble DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Ensemble DES-ECB ISO";
"06 07 2B 24 03 01 01 02 01"		= "Ensemble DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Ensemble DES-CBC ISO";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "Ensemble ES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "Ensemble DES3-ECB ISO";
"06 07 2B 24 03 01 03 02 01"		= "Ensemble ES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "Ensemble DES3-CBC ISO";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Ensemble DEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Ensemble IDEA-ECB ISO";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Ensemble DEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Ensemble IDEA-CBC ISO";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Chiffrement RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "Ensemble BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "Ensemble BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "Ensemble BSI-1-CBC PEM";

"06 04 2B 24 03 02"					= "Algorithme de hachage";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Simple longueur MDC2";
"06 05 2B 24 03 02 05"				= "Double longueur MDC2";
"06 04 2B 24 03 03"					= "Algorithme de signature";
"06 05 2B 24 03 03 01"				= "Signature RSA";

"06 06 2B 24 03 03 01 01"			= "Signature RSA avec SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Signature RSA avec SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Signature RSA avec SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Signature RSA avec SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Signature RSA avec SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Signature RSA avec SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Signature RSA avec SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Signature RSA avec SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Signature RSA avec SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Signature RSA avec SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Signature RSA avec SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Signature RSA avec SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Signature RSA avec SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Signature RSA avec SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Signature RSA avec SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Signature RSA avec SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Signature RSA avec SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Signature RSA avec SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Signature RSA avec SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Signature RSA avec SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Signature RSA avec SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Signature RSA avec SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Signature RSA avec SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Signature RSA avec SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Signature RSA avec SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Signature RSA avec SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Signature RSA avec RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Signature RSA avec RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Signature RSA avec RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Signature RSA avec RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Signature RSA avec RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Signature RSA avec RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Signature RSA avec RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Signature RSA avec RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Signature RSA avec RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Signature RSA avec RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Signature RSA avec RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Signature RSA avec RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Signature RSA avec RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Signature RSA avec RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Signature RSA avec RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Signature RSA avec RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Signature RSA avec RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Signature RSA avec RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Signature RSA avec RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Signature RSA avec RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Signature RSA avec RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Signature RSA avec RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Signature RSA avec RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Signature RSA avec RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Signature RSA avec RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Signature RSA avec RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Signature RSA avec RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Signature RSA avec RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Signature ECSIE";
"06 06 2B 24 03 03 02 01"			= "Signature ECSIE avec SHA-1";
"06 06 2B 24 03 03 02 02"			= "Signature ECSIE avec RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Signature ECSIE avec MD2";
"06 06 2B 24 03 03 02 04"			= "Signature ECSIE avec MD5";

"06 04 2B 24 03 04"					= "Schéma de signature";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 avec RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 avec RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 avec RND";

"06 03 2B 24 04"					= "Attribut";
"06 03 2B 24 05"					= "Règlement";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API propre au fabricant";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API propre aux fonctionnalités";
"06 03 2B 24 07"					= "Gestion de clé";
"06 04 2B 24 07 01"					= "Accord de clés";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transfert de clé";
"06 05 2B 24 07 02 01"				= "ISO9796-2 avec chiffrement RSA";

"06 05 2B 24 08 01 01"				= "Identifiant du règlement Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Service de répertoire";

"06 05 2B 24 08 03 01"				= "Date de création du certificat";
"06 05 2B 24 08 03 02"				= "Procuration";
"06 05 2B 24 08 03 03"				= "Admission";
"06 05 2B 24 08 03 04"				= "Limite monétaire";
"06 05 2B 24 08 03 05"				= "Déclaration de majorité";
"06 05 2B 24 08 03 06"				= "Numéro de série de la carte du circuit intégré";
"06 05 2B 24 08 03 07"				= "Référence de clé publique";
"06 05 2B 24 08 03 08"				= "Restriction";
"06 05 2B 24 08 03 09"				= "Récupérer si permis";
"06 05 2B 24 08 03 0A"				= "Certificat requis";
"06 05 2B 24 08 03 0B"				= "Autorités de nommage";
"06 05 2B 24 08 03 0C"				= "Certificat dans le répertoire depuis";
"06 05 2B 24 08 03 0D"				= "Hachage du certificat";

"06 05 2B 24 08 04 01"				= "Données personnelles";
"06 05 2B 24 08 04 08"				= "Restriction";
"06 07 2B 24 08 05 01 01 01"		= "RSA indique SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA indique RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA avec SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA avec RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA étendu";
"06 07 2B 24 08 05 01 02 02"		= "DSA avec RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificat";
"06 05 2B 24 08 06 02"				= "Référence du certificat";
"06 05 2B 24 08 06 03"				= "Certificat d’attribut";
"06 05 2B 24 08 06 04"				= "Référence d’attribut";
"06 05 2B 24 08 06 05"				= "Nom du fichier";
"06 05 2B 24 08 06 06"				= "Heure de stockage";
"06 05 2B 24 08 06 07"				= "Taille du fichier";
"06 05 2B 24 08 06 08"				= "Emplacement";
"06 05 2B 24 08 06 09"				= "Numéro de signature";
"06 05 2B 24 08 06 0A"				= "Auto-généré";

"06 05 2B 24 08 07 01"				= "Types de présentation Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binaire";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "Format RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Texte";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "Identifiant d’utilisateur";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Certificat d’extension Thawte";
"06 05 2B 65 01 04 01"				= "Extranet robuste";

/* X.520 */

"06 02 55 04"		= "Types d’attribut X.520";
"06 03 55 04 00"	= "Classe d’objets";
"06 03 55 04 01"	= "Nom d’entrée crénelé";
"06 03 55 04 02"	= "Informations";
"06 03 55 04 03"	= "Nom commun";
"06 03 55 04 04"	= "Nom de famille";
"06 03 55 04 05"	= "Numéro de série";
"06 03 55 04 06"	= "Nom du pays";
"06 03 55 04 07"	= "Nom de localité";
"06 04 55 04 07 01"	= "Nom de localité collective";
"06 03 55 04 08"	= "Nom de région ou province";
"06 04 55 04 08 01"	= "Nom de région/province collective";
"06 03 55 04 09"	= "Rue";
"06 04 55 04 09 01"	= "Rue collective";
"06 03 55 04 0A"	= "Nom de l’organisation";
"06 04 55 04 0A 01"	= "Nom de l’organisation collective";
"06 03 55 04 0B"	= "Nom de l’unité organisationnelle";
"06 04 55 04 0B 01"	= "Nom de l’unité organisationnelle collective";
"06 03 55 04 0C"	= "Titre";
"06 03 55 04 0D"	= "Description";
"06 03 55 04 0E"	= "Guide de recherche";
"06 03 55 04 0F"	= "Type d’entreprise";
"06 03 55 04 10"	= "Adresse postale";
"06 04 55 04 10 01"	= "Adresse postale collective";
"06 03 55 04 11"	= "CP";
"06 04 55 04 11 01"	= "Code postal collectif";
"06 03 55 04 12"	= "Boite postale";
"06 04 55 04 12 01"	= "Boite postale collective";
"06 03 55 04 13"	= "Nom du bureau de livraison physique";
"06 04 55 04 13 01"	= "Nom du bureau de livraison physique collectif";
"06 03 55 04 14"	= "Numéro de téléphone";
"06 04 55 04 14 01"	= "Numéro de téléphone collectif";
"06 03 55 04 15"	= "Numéro de Télex";
"06 04 55 04 15 01"	= "Numéro de Télex collectif";
"06 03 55 04 16"	= "Identifiant de terminal Teletex";
"06 04 55 04 16 01"	= "Identifiant du terminal Teletex collectif";
"06 03 55 04 17"	= "Fax";
"06 04 55 04 17 01"	= "Numéro de fax collectif";
"06 03 55 04 18"	= "Adresse X.121";
"06 03 55 04 19"	= "Numéro ISDN international";
"06 04 55 04 19 01"	= "Numéro ISDN international collectif";
"06 03 55 04 1A"	= "Adresse enregistrée";
"06 03 55 04 1B"	= "Indicateur de destination";
"06 03 55 04 1C"	= "Méthode de livraison préférée";
"06 03 55 04 1D"	= "Adresse de présentation";
"06 03 55 04 1E"	= "Contexte des applications gérées";
"06 03 55 04 1F"	= "Membre";
"06 03 55 04 20"	= "Propriétaire ";
"06 03 55 04 21"	= "Rôle de l’occupant";
"06 03 55 04 22"	= "Voir également";
"06 03 55 04 23"	= "Mot de passe utilisateur";
"06 03 55 04 24"	= "Certificat utilisateur";
"06 03 55 04 25"	= "Certificat de l’AC";
"06 03 55 04 26"	= "Liste de révocation des autorités";
"06 03 55 04 27"	= "Liste de révocation de certificats (CRL)";
"06 03 55 04 28"	= "Partager les paires de certificats";
"06 03 55 04 29"	= "Nom";
"06 03 55 04 2A"	= "Surnom";
"06 03 55 04 2B"	= "Initiales";
"06 03 55 04 2C"	= "Qualificatif de génération";
"06 03 55 04 2D"	= "Identifiant unique";
"06 03 55 04 2E"	= "Qualificatif DN";
"06 03 55 04 2F"	= "Guide de recherche amélioré";
"06 03 55 04 30"	= "Informations de protocole";
"06 03 55 04 31"	= "DN (Distinguished Name)";
"06 03 55 04 32"	= "Membre unique";
"06 03 55 04 33"	= "Identifiant de départ";
"06 03 55 04 34"	= "Algorithmes pris en charge";
"06 03 55 04 35"	= "Liste de révocation delta";
"06 03 55 04 36"	= "Autorisation";
"06 03 55 04 3A"	= "Partager les paires de certificats";

/* X.500 object classes */

"06 02 55 06"		= "Classe d’objets X.520";
"06 03 55 06 00"	= "Haut";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Pays";
"06 03 55 06 03"	= "Localité";
"06 03 55 06 04"	= "Organisation";
"06 03 55 06 05"	= "Unité d’organisation";
"06 03 55 06 06"	= "Personne";
"06 03 55 06 07"	= "Personne organisationnelle";
"06 03 55 06 08"	= "Rôle organisationnel";
"06 03 55 06 09"	= "Groupes de noms";
"06 03 55 06 0A"	= "Personne résidente";
"06 03 55 06 0B"	= "Procédé d’application";
"06 03 55 06 0C"	= "Entité d’application";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Périphérique";
"06 03 55 06 0F"	= "Forte authentification de l’utilisateur";
"06 03 55 06 10"	= "Autorité de certification";
"06 03 55 06 11"	= "Groupes de noms uniques";
"06 03 55 06 15"	= "Utilisateur de PKI";
"06 03 55 06 16"	= "AC de PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Algorithmes X.500";
"06 03 55 08 01"	= "Algorithmes de chiffrement X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Extensions de certificat X.509";
"06 03 55 1D 01"	= "Identifiant de clé d’autorité (ancien)";
"06 03 55 1D 02"	= "Attributs de la clé principale (ancien)";
"06 03 55 1D 03"	= "Règlements des certificats (ancien)";
"06 03 55 1D 04"	= "Restriction de l’utilisation de clé (ancien)";
"06 03 55 1D 05"	= "Mappage de règlement (ancien)";
"06 03 55 1D 06"	= "Contraintes des sous-arbres";
"06 03 55 1D 07"	= "Nom alternatif du sujet (ancien)";
"06 03 55 1D 08"	= "Nom alternatif de l’émetteur (ancien)";
"06 03 55 1D 09"	= "Attributs du répertoire de sujet";
"06 03 55 1D 0A"	= "Contraintes de base (ancien 2.5.29.10)";
"06 03 55 1D 0B"	= "Contraintes sur les noms (ancien)";
"06 03 55 1D 0C"	= "Contraintes de règlements (ancien)";
"06 03 55 1D 0D"	= "Contraintes de base (ancien 2.5.29.13)";
"06 03 55 1D 0E"	= "Identifiant de clé d’objet";
"06 03 55 1D 0F"	= "Utilisation de clé";
"06 03 55 1D 10"	= "Période d’utilisation de clé privée";
"06 03 55 1D 11"	= "Nom alternatif du sujet";
"06 03 55 1D 12"	= "Nom alternatif de l’émetteur";
"06 03 55 1D 13"	= "Contraintes élémentaires";
"06 03 55 1D 14"	= "Numéro de liste de révocation de certificats (CRL)";
"06 03 55 1D 15"	= "Code de raison CRL";
"06 03 55 1D 16"	= "Date d’expiration (ancien)";
"06 03 55 1D 17"	= "Code de suspension de certificat";
"06 03 55 1D 18"	= "Date d’invalidité";
"06 03 55 1D 19"	= "Points de distribution CRL (ancien)";
"06 03 55 1D 1A"	= "Envoi des points de distribution (ancien)";
"06 03 55 1D 1B"	= "Indicateur Delta CRL";
"06 03 55 1D 1C"	= "Envoi des points de distribution";
"06 03 55 1D 1D"	= "Émetteur de certificat";
"06 03 55 1D 1E"	= "Contraintes sur les noms";
"06 03 55 1D 1F"	= "Points de distribution CRL";
"06 03 55 1D 20"	= "Règlements des certificats";
"06 04 55 1D 20 00"	= "Identifiant règlement quelconque";
"06 03 55 1D 21"	= "Mappages de règlement";
"06 03 55 1D 22"	= "Contraintes de règlements";
"06 03 55 1D 23"	= "Identifiant de clé d’autorité";
"06 03 55 1D 24"	= "Contraintes de règlements";
"06 03 55 1D 25"	= "Utilisation de clé étendue";
"06 04 55 1D 25 00"	= "Utilisation de toute clé étendue";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algorithme de signature SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algorithme de signature Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algorithme de confidentialité SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algorithme de confidentialité Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algorithme d’intégrité SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algorithme d’intégrité Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algorithme de protection de jeton SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algorithme de protection de jeton Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algorithme de gestion de clé SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algorithme de gestion de clé Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algorithme de signature et de gestion de clé SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algorithme de gestion de clé Fortezza et de signature";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algorithme de signature de suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algorithme de confidentialité de suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algorithme d’intégrité de suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algorithme de protection de jeton de suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algorithme de gestion de clé de suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algorithmes de signature et de gestion de clé de suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algorithme de signature Fortezza mise à jour";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algorithmes de signature mise à jour et de gestion de clé Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algorithme d’intégrité mise à jour Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algorithme d’échange de clé";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algorithme Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algorithme de chiffrement de clé (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Format de message RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Contenu vide";
"06 09 60 86 48 01 65 02 01 02 03"	= "Type de contenu CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Type de contenu MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Type de contenu MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocole agent MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Type de contenu MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Contenu du message MSP réexpédié";
"06 09 60 86 48 01 65 02 01 02 49"	= "Paramètres du message MSP réexpédié";
"06 09 60 86 48 01 65 02 01 02 50"	= "Contenu du message CSP réexpédié";
"06 09 60 86 48 01 65 02 01 02 51"	= "Paramètres du message CSP réexpédié";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Règlement de sécurité SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "PRBAC mosaïque";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Règlement de sécurité";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Générique";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Règlement de sécurité par défaut";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certificat de gestion de clé SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certificat de signature SDNS de l’utilisateur";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certificat de signature et de gestion de clé SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certificat de gestion de clé Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certificat de de signature et de gestion de clé Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certificat de signature Fortezza de l’utilisateur";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certificat de signature de l’AC Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certificat de signature de l’AC SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vecteur auxiliaire";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Règlement de reçu";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Adhésion";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administrateurs";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS signature CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL de signature SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Liste de révocation de certificats (CRL) SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Liste de révocation de certificats (CRL) Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Processeur d’adresse exemptée";
"06 09 60 86 48 01 65 02 01 05 30"	= "Garde";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algorithmes gérés";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certificat de gestion de clé de suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certificat de signature et de gestion de clé de suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certificat de signature utilisateur de suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Informations PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Contraintes de l’AC PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Privilèges de gestion de clé ou signature";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilèges Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "Attribut étiqueté";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Fichier d’informations de règlement";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Fichier d’information du règlement Sec";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Contrainte d’autorisation de l’AC";

"06 09 60 86 48 01 65 02 01 07 01"		= "Extensions CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Catégories de sécurité ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilèges SSL";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilèges de signature";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilèges de gestion de clé";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilège de l’ensemble d’étiquettes nommé";
"06 09 60 86 48 01 65 02 01 0B 01"			= "Démonstration UK";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Département de la défense des États-Unis de classe 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Département de la défense des États-Unis de classe 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Département de la défense des États-Unis de classe 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Département de la défense des Etats-Unis de classe 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Département de la défense des Etats-Unis PKI de classe 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Règlement de sécurité de test";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 - Ensemble d’étiquettes zéro";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 - Ensemble d’étiquettes un";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 - Ensemble d’étiquettes deux";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Catégories de sécurité TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 - Ensemble d’étiquettes zéro";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 - Ensemble d’étiquettes un";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 - Ensemble d’étiquettes deux";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Catégories de sécurité Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka - Nom de l’ensemble d’étiquettes 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka - Nom de l’ensemble d’étiquettes 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka - Nom de l’ensemble d’étiquettes 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Entrée CRL de test";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Étiquette";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identifiant du règlement GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identifiant FBCA de règlement rudimentaire";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identifiant FBCA de règlement de base";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identifiant FBCA de règlement moyen";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identifiant FBCA de règlement élevé";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Clé KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Extensions";
"06 09 60 86 48 01 65 03 02 03 01"		= "Technique de récupération de clé";
"06 09 60 86 48 01 65 03 02 03 02"		= "Possibilité de récupérer la clé";
"06 09 60 86 48 01 65 03 02 03 03"		= "Récupération de clé";
"06 08 60 86 48 01 65 03 02 04"			= "Schémas de récupération de clé";
"06 08 60 86 48 01 65 03 02 05"			= "Extension CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algorithme NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algorithme Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC ensemble IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC ensemble IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC ensemble IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Ensemble RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 avec chiffrement RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 avec chiffrement RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 avec chiffrement RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM condensé";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC avec SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC avec MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Ensemble RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Paquet MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Chiffrement RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Mot de passe NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Type d’attribut de PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Attributs de sécurité";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Limite de confiance";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identifiant objet Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Extension du certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Type de certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL de base de Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL de révocation Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL de révocation de l’AC Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL de téléchargement CRL Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL de téléchargement du certificat de l’AC Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL de renouvellement du certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL du règlement de l’AC Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL de la page d’accueil du certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo de l’entité de certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Image utilisateur de certificat Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nom du serveur SSL Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Commentaire de certificat Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Type de données Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "Adresse URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Séquence de certificat Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL de certificat Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identifiant de l’objet du répertoire Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Définitions LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Permis automobile";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Numéro de département";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Numéro d’employé";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Type d’employé";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Personne organisationnelle Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Cryptographie SGC (Server-Gated Cryptography)";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Extension VPN Verisign inconnue";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Extension VPN Verisign inconnue";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identifiant du règlement Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Notice de Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "AC Verisign SGC";

/* SET */

"06 03 67 2A 00"	= "Type de contenu";
"06 04 67 2A 00 00"	= "Données PAN";
"06 04 67 2A 00 01"	= "Jeton PAN";
"06 04 67 2A 00 02"	= "PAN uniquement";

"06 03 67 2A 01"	= "Extension du message";
"06 03 67 2A 02"	= "Champ";
"06 04 67 2A 02 00"	= "Nom complet";
"06 04 67 2A 02 01"	= "Surnom";
"06 04 67 2A 02 02"	= "Nom de famille";
"06 04 67 2A 02 03"	= "Nom de famille de naissance";
"06 04 67 2A 02 04"	= "Nom de l’emplacement";
"06 04 67 2A 02 05"	= "Numéro d’identification";
"06 04 67 2A 02 06"	= "Mois";
"06 04 67 2A 02 07"	= "Date";
"06 04 67 2A 02 08"	= "Adresse";
"06 04 67 2A 02 09"	= "Téléphone";
"06 04 67 2A 02 0A"	= "Quantité";
"06 04 67 2A 02 0B"	= "Numéro de compte";
"06 04 67 2A 02 0C"	= "Phrase secrète";

"06 03 67 2A 03"		= "Attribut";
"06 04 67 2A 03 00"		= "Certificat";
"06 05 67 2A 03 00 00"	= "Empreinte de la clé racine";
"06 05 67 2A 03 00 01"	= "Règlement supplémentaire";

"06 03 67 2A 04"	= "Algorithme";
"06 03 67 2A 05"	= "Règlement";
"06 04 67 2A 05 00"	= "Racine";
"06 03 67 2A 06"	= "Module";
"06 03 67 2A 07"	= "Extension de certificat";
"06 04 67 2A 07 00"	= "Clé racine hachée";
"06 04 67 2A 07 01"	= "Type de certificat";
"06 04 67 2A 07 02"	= "Données du vendeur";
"06 04 67 2A 07 03"	= "Certificat de carte requis";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "Extensions SET";
"06 04 67 2A 07 06"	= "Qualificatif SET";

"06 03 67 2A 08"	= "Marque";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Fournisseur";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "National";
"06 05 67 2A 0A E2 00"	= "Japon";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Clé racine hachée";
"06 04 86 8D 6F 03"	= "Type de certificat";
"06 04 86 8D 6F 04"	= "Données du vendeur";
"06 04 86 8D 6F 05"	= "Certificat de carte requis";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "Qualificatif SET";
"06 04 86 8D 6F 63"	= "Données SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Sécurité des données Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identifiant du règlement de confiance Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Règlement Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Règlement élémentaire Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Règlement SSL Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Règlement de la création de certificat local Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Règlement de création de CSR locales Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Règlement de révocation CRL Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Règlement de révocation OCSP Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Règlement S/MIME Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Règlement d’authentification étendue Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Règles de signature de mises à jour de logiciels Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Règlement Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Règles iChat Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Règles de signature de ressources Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Règles pour client Kerberos Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Règles pour serveur Kerberos Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Règlement de signature de code Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Règlement de signature de paquets Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Identifiant de l’algorithme de sécurité Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE (cryptage elliptique rapide)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Compression sécurisée Apple (CSA)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE avec signature MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE avec signature SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Chiffrement Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (expérimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE avec signature  ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identifiant de certificat .Mac Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Demande de certificat .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Demande de certificat d’identité .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Demande de certificat de signature du courrier électronique .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Demande de certificat de chiffrement du courrier électronique .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Demande de liste d’archive .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Demande de stockage d’archive .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Demande de levée d’archive .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Demande de suppression d’archive .Mac Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Extension de certificat .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identité .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Signature du courrier électronique .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Chiffrement du courrier électronique .Mac Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Valeur de requête de certificat .Mac Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nom d’utilisateur";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Mot de passe";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nom d’hôte";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Indicateur de renouvellement";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Indicateur asynchrone";

"06 08 2A 86 48 86 F7 63 64 04" = "Utilisation de clé étendue Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Signature de code Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Signature de code Apple (développement)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Signature de mises à jour de logiciels Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Signature de code Apple (réservé)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Signature de ressources Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Signature iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Chiffrement iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identité système Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Règlements de certificats Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Règlement de certificat Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Politique de certification .Mac Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Signature de code";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Sécurité Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formats de sécurité Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Extensions de certificat X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Extensions de certificat privé X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Bitmap de signature de sujet";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Image du sujet";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Adresse électronique du sujet";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Utiliser des dérogations";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algorithmes de sécurité Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 avec ECDSA";

/* end */
